<a href="https://colab.research.google.com/github/meesumabidi/Data-analysis/blob/main/pands.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

df=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns = ["A","B","C"] , index= ["1","2","3"])
df

   A  B  C
1  1  2  3
2  4  5  6
3  7  8  9

In [ ]:
df1 =df.drop(columns=['A'])
df1

   B  C
1  2  3
2  5  6
3  8  9

In [ ]:
df1 =df.drop(columns=['B'],axis = 1)
df1

   A  C
1  1  3
2  4  6
3  7  9

In [ ]:
thisdict = {
  "Name": ["Jane","Jan","John","Jabin","Jace"],
  "ID": [100,102,104,106,108],
  "Marks" : [74,92,58,81,66]
}

In [ ]:
thisdict

{'ID': [100, 102, 103, 104, 105],
 'Marks': [74, 92, 58, 81, 66],
 'Name': ['Jane', 'Jan', 'John', 'Jabin', 'Jace']}

In [ ]:
df3 = pd.DataFrame(thisdict)
df3

    Name   ID  Marks
0   Jane  100     74
1    Jan  102     92
2   John  104     58
3  Jabin  106     81
4   Jace  108     66

In [ ]:
lst1 = [['Jane', '100', '74' ],
 ['Jan', '102', '92' ],
 ['John', '104', '58' ],
['Jabin', '106', '81' ],
['Jace', '108', '66' ]]
df = pd.DataFrame(lst1, columns =['Name', 'Age','Mark'])
df

    Name  Age Mark
0   Jane  100   74
1    Jan  102   92
2   John  104   58
3  Jabin  106   81
4   Jace  108   66

In [ ]:
#arr = np.dstack((newarr1, newarr2))

#arr

In [ ]:
import numpy as np

arr1 = np.array([0, 1, 2, 3, 4])
arr2 = np.array(["Jane", "Jan", "John", "Jabin", "Jace"])
newarr1 = arr1.reshape(5, 1)
newarr2 = arr2.reshape(5, 1)
print(newarr1)
print(newarr2)

[[0]
 [1]
 [2]
 [3]
 [4]]
[['Jane']
 ['Jan']
 ['John']
 ['Jabin']
 ['Jace']]

In [ ]:
arr = np.concatenate((newarr1, newarr2),axis =1)
arr.view()
df = pd.DataFrame(arr, columns =['Name', 'Age'])
df

  Name    Age
0    0   Jane
1    1    Jan
2    2   John
3    3  Jabin
4    4   Jace